# Data Exploration

## Instructions
There are some data files related to transaction saved under the [data](../data) folder:
- Looking into the data using appropriate functions and extract the fields in the data.
- For each data, describe what the data is about and what fields are saved.

You need to answer the questions and perform the task below:
- How many transactions are in GBP?
- How many transactions are NOT in USD?
- What is the average and mediam transaction in USD?
- Construct a table showing the number of transactions in EACH currency

Note:
- You are NOT ALLOWED to import other library or package
- You can write you own functions
- Your answers should be readable with approprate comments
- You can refer to [markdown cheatsheet](https://github.com/adam-p/markdown-here/wiki/Markdown-Cheatsheet) if you are not familar with Markdown

## Import libraries

In [7]:
# Usual libraries are imported here
import os
import yaml
import pandas as pd
import matplotlib
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

## Please perform your tasks below and answer the questions

# countries

In [9]:
country=pd.read_csv('../data/countries.csv')
country.head(10)

  CODE                  NAME CODE3  NUMCODE  PHONECODE
0   AF           Afghanistan   AFG        4         93
1   AL               Albania   ALB        8        355
2   DZ               Algeria   DZA       12        213
3   AS        American Samoa   ASM       16       1684
4   AO                Angola   AGO       24        244
5   AI              Anguilla   AIA      660       1264
6   AG  Antigua and  Barbuda   ATG       28       1268
7   AR             Argentina   ARG       32         54
8   AM               Armenia   ARM       51        374
9   AW                 Aruba   ABW      533        297

it contains code name code3 numcode phonecode

# currency

In [10]:
currency=pd.read_csv('../data/currency_details.csv')
currency.head(10)

   CCY  EXPONENT  IS_CRYPTO
0  AED         2      False
1  AFN         2      False
2  ALL         2      False
3  AMD         2      False
4  ANG         2      False
5  AOA         2      False
6  ARS         2      False
7  AUD         2      False
8  AWG         2      False
9  AZN         2      False

it contains ccy exponent is_crypto

# fraudsters

In [11]:
fraudsters=pd.read_csv('../data/fraudsters.csv')
fraudsters.head(10)

                                USER_ID
0  5270b0f4-2e4a-4ec9-8648-2135312ac1c4
1  848fc1b1-096c-40f7-b04a-1399c469e421
2  27c76eda-e159-4df3-845a-e13f4e28a8b5
3  a27088ef-9452-403d-9bbb-f7b10180cdda
4  fb23710b-609a-49bf-8a9a-be49c59ce6de
5  3a1e97cd-69a7-4c68-a98c-e0d7d606b07b
6  e7b6e022-76ca-4fe9-992e-0773a4715b0c
7  e7876b06-bcd8-4193-9eaa-b477313f6f1a
8  5b6f20a3-b39a-4f1b-bc5a-974daab4d2ec
9  7377f2fc-4585-49e8-8896-df332efc51c8

it contains uer_id

# german_credit_data

In [12]:
german=pd.read_csv('../data/german_credit_data.csv')
german.head(10)

,Unnamed: 0,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
0,0,67,male,2,own,NaN,little,1169,6,radio/TV
1,1,22,female,2,own,little,moderate,5951,48,radio/TV
2,2,49,male,1,own,little,NaN,2096,12,education
3,3,45,male,2,free,little,little,7882,42,furniture/equipment
4,4,53,male,2,free,little,little,4870,24,car
5,5,35,male,1,free,NaN,NaN,9055,36,education
6,6,53,male,2,own,quite rich,NaN,2835,24,furniture/equipment
7,7,35,male,3,rent,little,moderate,6948,36,car
8,8,61,male,1,own,rich,NaN,3059,12,radio/TV
9,9,28,male,3,own,little,moderate,5234,30,car

it contains index age sex job housing saving accounts checking account credit amount duration purpose

# users

In [13]:
users=pd.read_csv('../data/users.csv')
users.head(10)

,ID,HAS_EMAIL,PHONE_COUNTRY,IS_FRAUDSTER,TERMS_VERSION,CREATED_DATE,STATE,COUNTRY,BIRTH_YEAR,KYC,FAILED_SIGN_IN_ATTEMPTS
0,1872820f-e3ac-4c02-bdc7-727897b60043,1,GB||JE||IM||GG,False,2018-05-25,2017-08-06 07:33:33.341000,ACTIVE,GB,1971,PASSED,0
1,545ff94d-66f8-4bea-b398-84425fb2301e,1,GB||JE||IM||GG,False,2018-01-01,2017-03-07 10:18:59.427000,ACTIVE,GB,1982,PASSED,0
2,10376f1a-a28a-4885-8daa-c8ca496026bb,1,ES,False,2018-09-20,2018-05-31 04:41:24.672000,ACTIVE,ES,1973,PASSED,0
3,fd308db7-0753-4377-879f-6ecf2af14e4f,1,FR,False,2018-05-25,2018-06-01 17:24:23.852000,ACTIVE,FR,1986,PASSED,0
4,755fe256-a34d-4853-b7ca-d9bb991a86d3,1,GB||JE||IM||GG,False,2018-09-20,2017-08-09 15:03:33.945000,ACTIVE,GB,1989,PASSED,0
5,1cc43441-bb77-47ef-98e5-4af09ccf3c83,1,GB||JE||IM||GG,False,2018-03-20,2017-12-30 16:44:36.223000,ACTIVE,GB,1979,PASSED,0
6,5a9bae2c-db88-4744-b710-644fa625c7bb,1,FR,False,2018-03-20,2016-02-17 18:16:20.933000,ACTIVE,FR,1992,PASSED,0
7,60b99cff-7bf8-44e8-9ebf-9fd59d9cbca2,1,SI,False,2018-05-25,2017-01-07 11:02:29.410000,ACTIVE,SI,1992,PASSED,0
8,25356d21-d942-47d5-b3a9-d521c79a2ae6,1,PL,False,2018-01-13,2017-12-15 17:22:24.663000,ACTIVE,PL,1983,NONE,0
9,fb125ed6-c85c-47b3-bb96-3493683659b8,1,GB||JE||IM||GG,False,2018-05-25,2017-08-17 15:59:21.351000,ACTIVE,GB,1980,PASSED,0

it contains ID	HAS_EMAIL	PHONE_COUNTRY	IS_FRAUDSTER	TERMS_VERSION	CREATED_DATE	STATE	COUNTRY	BIRTH_YEAR	KYC	FAILED_SIGN_IN_ATTEMPTS

# *****************************************************

In [15]:
transactions=pd.read_csv('../data/transactions/transactions.csv')
transactions.head(10)

,CURRENCY,AMOUNT,STATE,CREATED_DATE,MERCHANT_CATEGORY,MERCHANT_COUNTRY,ENTRY_METHOD,USER_ID,TYPE,SOURCE,ID,AMOUNT_USD
0,GBP,175,COMPLETED,2017-12-20 12:46:20.294,cafe,GBR,cont,8f99c254-7cf2-4e35-b7e4-53804d42445d,CARD_PAYMENT,GAIA,b3332e6f-7865-4d6e-b6a5-370bc75568d8,220
1,EUR,2593,COMPLETED,2017-12-20 12:38:47.232,bar,AUS,cont,ed773c34-2b83-4f70-a691-6a7aa1cb9f11,CARD_PAYMENT,GAIA,853d9ff8-a007-40ef-91a2-7d81e29a309a,2885
2,EUR,1077,COMPLETED,2017-12-20 12:34:39.668,NaN,CZE,cont,eb349cc1-e986-4bf4-bb75-72280a7b8680,CARD_PAYMENT,GAIA,04de8238-7828-4e46-91f1-050a9aa7a9df,1198
3,GBP,198,COMPLETED,2017-12-20 12:45:50.555,supermarket,GBR,cont,dc78fbc4-c936-45d3-a813-e2477ac6d74b,CARD_PAYMENT,GAIA,2b790b9b-c312-4098-a4b3-4830fc8cda53,249
4,EUR,990,COMPLETED,2017-12-20 12:45:32.722,NaN,FRA,cont,32958a5c-2532-42f7-94f9-127f2a812a55,CARD_PAYMENT,GAIA,6469fc3a-e535-41e9-91b9-acb46d1cc65d,1101
5,EUR,2000,REVERTED,2017-12-20 12:44:14.216,NaN,NaN,misc,7a7ebaa8-6c24-4c4f-bb09-c30b3b98b73c,TOPUP,HERA,b074480b-d09b-40cb-aed3-e45039ae8e25,2225
6,GBP,300,COMPLETED,2017-12-20 12:44:10.132,NaN,GBR,chip,c069a845-b843-475e-af4f-a27e379f1c76,CARD_PAYMENT,GAIA,8c4328f3-5f39-4526-9ff8-cddb72cea623,378
7,EUR,1000,COMPLETED,2017-12-20 12:42:58.51,NaN,GRC,chip,f9588784-a994-4bfc-b4a0-d97f8c4941f7,CARD_PAYMENT,GAIA,f8bd44b7-a812-4468-9994-850d4dc1d0b0,1112
8,GBP,1000,COMPLETED,2017-12-20 12:42:52.014,NaN,NaN,misc,c248610a-3e08-4620-a6c3-89eb338fe155,TOPUP,HERA,1e819f57-8aed-4602-ae8f-58e1862836f0,1260
9,EUR,80,COMPLETED,2017-12-20 12:41:53.683,NaN,LTU,cont,a827cf38-cb43-46af-b728-413c313b5b6d,CARD_PAYMENT,GAIA,cabba07c-d0f1-474e-b3a3-53ed50e21c38,89

In [22]:
GBP=len(transactions[transactions['CURRENCY']=='GBP'])
print(GBP)

339091

In [23]:
NUSD=len(transactions[transactions['CURRENCY']!='USD'])
print(NUSD)

657109

In [35]:
ave=np.mean(transactions[transactions['CURRENCY'] == 'USD'].AMOUNT)
me=np.median(transactions[transactions['CURRENCY'] == 'USD'].AMOUNT)
print(ave,'\n',me)

11598.75470800837
 2000.0

In [36]:
currencys = transactions['CURRENCY'].unique()
numbers = [len(transactions[transactions['CURRENCY']==i]) for i in currencys]
data = {'currency':currencys,'numbers':numbers}
table = pd.DataFrame(data)
print(table)

   currency  numbers
0       GBP   339091
1       EUR   264695
2       CHF     5761
3       HUF     1446
4       TRY      338
5       USD    31542
6       PLN    22362
7       LTC      137
8       RON     5837
9       DKK     1711
10      NZD      717
11      AUD     2110
12      INR      207
13      THB      690
14      NOK     2602
15      ZAR     1126
16      AED      847
17      SEK     1579
18      QAR       28
19      CAD     1463
20      ILS      522
21      SGD      487
22      ETH      197
23      BTC      283
24      CZK     1507
25      JPY      733
26      HKD      480
27      MAD      115
28      XRP       38